# GROUP BY

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
    'Person': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
    'Sales': [200,120,340,124,243,350]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [5]:
df.groupby('Company')

In [8]:
byComp = df.groupby('Company')

In [9]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [10]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [11]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [12]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [13]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [19]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [23]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64